In [ ]:
# ACID property - Atomicity, Consistency, Isolation, Durability
# SQL - Structured Query Language

In [1]:
import sqlite3

In [41]:
# Setting up dB

conn = sqlite3.connect('test.db')

In [42]:
mycursor = conn.cursor()

In [14]:
mycursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [15]:
print(mycursor.fetchall())

[]

In [16]:
conn.execute('''CREATE TABLE IF NOT EXISTS COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')

In [17]:
# Getting list of tables 

mycursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [18]:
print(mycursor.fetchall())

[('COMPANY',)]

In [19]:
# Insert values in tables

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()

In [20]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("AGE = ", row[2])
    print("ADDRESS = ", row[3])
    print("SALARY = ", row[4], "\n")

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [21]:
# Update query 

conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1")
conn.commit()

In [22]:
print("Total number of rows updated :", conn.total_changes)

Total number of rows updated : 5

In [23]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("AGE = ", row[2])
    print("ADDRESS = ", row[3])
    print("SALARY = ", row[4], "\n")

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
AGE =  25
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [24]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
print(cursor.fetchall())

[(1, 'Paul', 32, 'California', 25000.0), (2, 'Allen', 25, 'Texas', 15000.0), (3, 'Teddy', 23, 'Norway', 20000.0), (4, 'Mark', 25, 'Rich-Mond ', 65000.0)]

In [25]:
# Delete query 

conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()

In [26]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("AGE = ", row[2])
    print("ADDRESS = ", row[3])
    print("SALARY = ", row[4], "\n")

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [27]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY WHERE SALARY>15000")
for row in cursor:
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("AGE = ", row[2])
    print("ADDRESS = ", row[3])
    print("SALARY = ", row[4], "\n")

ID =  1
NAME =  Paul
AGE =  32
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
AGE =  23
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
AGE =  25
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [32]:
# Insert some NULL value records

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,SALARY) VALUES (5, 'Shivam', 32, 20000.00 )");

conn.commit()

In [36]:
cursor = conn.execute("SELECT id, name, age, address, salary from COMPANY WHERE ADDRESS IS NULL")

In [34]:
cursor.fetchall()    # Fetches all records

[(5, 'Shivam', 32, None, 20000.0)]

In [37]:
cursor.fetchone()    # Fetches only single record

(5, 'Shivam', 32, None, 20000.0)

In [38]:
cursor.lastrowid

5

In [43]:
# Get the total row count from table 

cursor = conn.execute("SELECT COUNT(*) from COMPANY")

In [44]:
cursor.fetchall()

[(4,)]

In [45]:
conn.close()